Autodesk.Revit.DB.Structure.ReinforcementRoundingSource
An enumerated type listing the possible sources for reinforcement rounding overrides.
Since:
2014
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementRoundingSource.Element
Rounding overrides from Rebar or RebarInSystem or FabricSheet or FabricArea instances are in use.

Autodesk.Revit.DB.Structure.ReinforcementRoundingSource.Type
Rounding overrides from the rebar types or fabric types are in use.

Autodesk.Revit.DB.Structure.ReinforcementRoundingSource.ReinforcementSettings
Rounding overrides from the ReinforcementSettings are in use.

Autodesk.Revit.DB.Structure.ReinforcementRoundingSource.None
No rounding overrides are in use.